catalog-service/target/classes/catalog.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="catalog-style.xsl"?>
<!--  Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.5 git-revision#7ddc91f.  -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
             xmlns:tns="http://catalog.globalbooks.com/"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             name="CatalogService"
             targetNamespace="http://catalog.globalbooks.com/">

    <types>
        <xsd:schema targetNamespace="http://catalog.globalbooks.com/">
            <xsd:element name="getBookRequest">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="isbn" type="xsd:string"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
            <xsd:element name="getBookResponse">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="title" type="xsd:string"/>
                        <xsd:element name="author" type="xsd:string"/>
                        <xsd:element name="price" type="xsd:double"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </types>

    <message name="getBookRequest">
        <part name="parameters" element="tns:getBookRequest"/>
    </message>
    <message name="getBookResponse">
        <part name="parameters" element="tns:getBookResponse"/>
    </message>

    <portType name="CatalogPortType">
        <operation name="getBook">
            <input wsam:Action="http://catalog.globalbooks.com/CatalogPortType/getBookRequest" message="tns:getBookRequest"/>
            <output wsam:Action="http://catalog.globalbooks.com/CatalogPortType/getBookResponse" message="tns:getBookResponse"/>
        </operation>
    </portType>

    <binding name="CatalogPortBinding" type="tns:CatalogPortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="getBook">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>

    <service name="CatalogService">
        <port name="CatalogPort" binding="tns:CatalogPortBinding">
            <soap:address location="http://localhost:8080/catalog-service/catalog"/>
        </port>
    </service>
</definitions>